# Fall 2021 Data Science Intern Challenge

In [2]:
import pandas as pd
import numpy as np

In [10]:
# read in sample data
df = pd.read_csv('2019 Winter Data Science Intern Challenge Data Set - Sheet1.csv')

In [8]:
# inspection of sample data
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   order_id        5000 non-null   int64
 1   shop_id         5000 non-null   int64
 2   user_id         5000 non-null   int64
 3   order_amount    5000 non-null   int64
 4   total_items     5000 non-null   int64
 5   payment_method  5000 non-null   object
 6   created_at      5000 non-null   object
dtypes: int64(5), object(2)
memory usage: 273.6+ KB

In [9]:
df.head()

,order_id,shop_id,user_id,order_amount,total_items,payment_method,created_at
0,1,53,746,224,2,cash,2017-03-13 12:36:56
1,2,92,925,90,1,cash,2017-03-03 17:38:52
2,3,44,861,144,1,cash,2017-03-14 4:23:56
3,4,18,935,156,1,credit_card,2017-03-26 12:43:37
4,5,18,883,156,1,credit_card,2017-03-01 4:35:11

In [12]:
# convert created_at column to datetime format for better sorting and slicing of data
df.created_at = pd.to_datetime(df.created_at)

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   order_id        5000 non-null   int64
 1   shop_id         5000 non-null   int64
 2   user_id         5000 non-null   int64
 3   order_amount    5000 non-null   int64
 4   total_items     5000 non-null   int64
 5   payment_method  5000 non-null   object
 6   created_at      5000 non-null   datetime64[ns]
dtypes: datetime64[ns](1), int64(5), object(1)
memory usage: 273.6+ KB

### Question 1
On Shopify, we have exactly 100 sneaker shops, and each of these shops sells only one model of shoe. We want to do some analysis of the average order value (AOV). When we look at orders data over a 30 day window, we naively calculate an AOV of $3145.13. Given that we know these shops are selling sneakers, a relatively affordable item, something seems wrong with our analysis.

#### Think about what could be going wrong with our calculation. Think about a better way to evaluate this data

In [43]:
# calculation of AOV provided
total_revenue =sum(df.order_amount)
total_orders = df.order_id.count()
AOV = total_revenue/total_orders
AOV

3145.128

In [44]:
# What is wrong is that the AOV calculation provided is dividing total revenue by total orders 
# instead of total items sold, which will give you the average revenue per order instead of average per sneaker.
# Diving revenue by total orders instead of total items will arrive at a higher figure because 
# there could be multiple items per order.

#### What metric would you report for this dataset?

In [ ]:
# to get a better sense on how much customers are spending average per sneaker, 
# a better metric is to devide total revenue by total number of items sold for the given 30 days period.

#### What is its value?

In [ ]:
# The value arrived at using the new metric is $357.92. Below is the calculation

In [45]:
total_items = df.total_items.sum()

In [46]:
total_revenue/total_items

357.92152221412965

### Question 2
For this question youâ€™ll need to use SQL. Follow this link to access the data set required for the challenge. Please use queries to answer the following questions. Paste your queries along with your final numerical answers below.

#### How many orders were shipped by Speedy Express in total?

In [ ]:
# SELECT COUNT(ShipperName) FROM Orders O
# JOIN Shippers S
# ON O.ShipperID = S.ShipperID
# WHERE ShipperName = 'Speedy Express';

# 54 orders where shipped by Speedy Express in  total

#### What is the last name of the employee with the most orders?

In [ ]:
# SELECT O.EmployeeID, E.LastName, COUNT(OrderID) Count_orders FROM [Orders] O
# JOIN Employees E
# ON O.EmployeeID = E.EmployeeID
# GROUP BY O.EmployeeID
# ORDER BY Count_orders DESC;

# Peacock is the last name of the employee with the most orders

#### What product was ordered the most by customers in Germany?

In [ ]:
# SELECT P.ProductID, P.ProductName, COUNT(P.ProductName) count_product, C.Country FROM [Orders] O
# JOIN OrderDetails OD
# ON O.OrderID = OD.OrderID
# JOIN Customers C
# ON O.CustomerID = C.CustomerID
# JOIN Products P
# ON OD.ProductID = P.ProductID
# WHERE C.Country = 'Germany'
# GROUP BY P.ProductID
# ORDER BY count_product DESC;

# The Gorgonzola Telino was ordered most by customers in Germany